[
  {
  "recipeName": "Cottage Pie",
  "prepTimeMinutes": 30,
  "cookTimeMinutes": 90,
  "servings": 6,
  "ingredients": [
    { "quantity": 50, "unit": "ml", "ingredient": "Olive Oil" },
    { "quantity": 1, "unit": "unit", "ingredient": "Large Onion" },
    { "quantity": 650, "unit": "g", "ingredient": "Beef Mince" },
    { "quantity": 2, "unit": "tbsp", "ingredient": "Tomato Purée" },
    { "quantity": 1, "unit": "tbsp", "ingredient": "Plain Flour" },
    { "quantity": 150, "unit": "ml", "ingredient": "Red Wine" },
    { "quantity": 4, "unit": "sprigs", "ingredient": "Thyme Leaves" },
    { "quantity": 400, "unit": "ml", "ingredient": "Beef Stock" },
    { "quantity": null, "unit": null, "ingredient": "Worcestershire Sauce" },
    { "quantity": 900, "unit": "g", "ingredient": "Potatoes" },
    { "quantity": 115, "unit": "g", "ingredient": "Butter" },
    { "quantity": 125, "unit": "ml", "ingredient": "Milk" },
    { "quantity": 150, "unit": "g", "ingredient": "Frozen Peas" },
    { "quantity": 50, "unit": "g", "ingredient": "Butter" }
  ],
  "method": [
    "Heat half the oil in a large heavy-based pan. Add the onion and cook until softened. Tip it onto a plate.",
    "Return the pan to the heat and add the remaining oil. When hot, fry the mince in batches for 4–5 minutes until browned all over.",
    "Stir in the cooked onion and tomato purée and cook for 1 minute. Stir in the flour and cook for another minute. Pour in the red wine, scraping up caramelised bits, then add the thyme.",
    "Add the stock and simmer for 45 minutes until the mince is tender and the mixture has thickened. Season to taste and add Worcestershire sauce. Keep warm over very low heat.",
    "For the mash, boil the potatoes in salted water for 12–15 minutes until tender.",
    "Drain and return potatoes to the pan. Heat for 1 minute to remove moisture. Mash well, then add butter and milk, beating to form a smooth mash. Season to taste.",
    "Preheat grill to high. Spoon the filling into a baking dish and spread mash over the top. Grill for 8–10 minutes until golden-brown.",
    "Boil peas in boiling water for 3–4 minutes, drain, and add butter. Serve the cottage pie with the peas."
  ]
},
  {
  "recipeName": "Indonesian Inspired Chicken Biryani",
  "prepTimeMinutes": 90,
  "cookTimeMinutes": 45,
  "servings": 7,
  "ingredients": [
    { "quantity": "150", "unit": "g", "ingredient": "Natural Plain Yoghurt" },
    { "quantity": "4", "unit": "tbsp", "ingredient": "Sambal Oelek Chilli Paste" },
    { "quantity": "2", "unit": "tbsp", "ingredient": "Kecap Manis" },
    { "quantity": "1", "unit": "tbsp", "ingredient": "Tamarind Paste" },
    { "quantity": "1", "unit": "tbsp", "ingredient": "Ginger" },
    { "quantity": "2", "unit": null, "ingredient": "Garlic Cloves" },
    { "quantity": "2", "unit": "tsp", "ingredient": "Ground Cinnamon" },
    { "quantity": "1", "unit": "tsp", "ingredient": "Ground Cardamom" },
    { "quantity": "1", "unit": "tsp", "ingredient": "Ground Turmeric" },
    { "quantity": "1/2", "unit": "tsp", "ingredient": "Sea Salt" },
    { "quantity": "1", "unit": "tbsp", "ingredient": "Vegetable Oil" },
    { "quantity": "10", "unit": null, "ingredient": "Chicken Thighs Bone In Skin Removed" },
    { "quantity": "4", "unit": "tbsp", "ingredient": "Vegetable Oil" },
    { "quantity": "3", "unit": null, "ingredient": "Onions" },
    { "quantity": "4", "unit": null, "ingredient": "Cardamom Pods" },
    { "quantity": "1", "unit": null, "ingredient": "Cinnamon Stick" },
    { "quantity": "2", "unit": null, "ingredient": "Cloves" },
    { "quantity": "3", "unit": null, "ingredient": "Star Anise" },
    { "quantity": "25", "unit": "g", "ingredient": "Desiccated Coconut" },
    { "quantity": "2", "unit": "tsp", "ingredient": "Pink Peppercorns" },
    { "quantity": "2", "unit": "tbsp", "ingredient": "Sea Salt" },
    { "quantity": "2", "unit": "tsp", "ingredient": "Sesame Oil" },
    { "quantity": "1", "unit": "tsp", "ingredient": "Lime Juice" },
    { "quantity": "600", "unit": "g", "ingredient": "Basmati Rice" },
    { "quantity": "1", "unit": "tsp", "ingredient": "Sesame Oil" },
    { "quantity": "2", "unit": "tsp", "ingredient": "Cumin Seeds Toasted" },
    { "quantity": "25", "unit": "g", "ingredient": "Desiccated Coconut" },
    { "quantity": "50", "unit": "g", "ingredient": "Dried Cranberries" },
    { "quantity": null, "unit": null, "ingredient": "Reserved Chicken Skin" },
    { "quantity": null, "unit": null, "ingredient": "Freshly Chopped Coriander" }
  ],
  "method": [
    "Pour or scrape out the yoghurt into a dish large enough for the chicken pieces in a single layer. Add sambal oelek, kecap manis, tamarind paste, grated ginger, garlic, cinnamon, cardamom, ground turmeric, salt, and vegetable oil and stir to combine.",
    "Add the skinless bone-in chicken thighs to the marinade, coating them well. Leave to marinate while preparing the onions.",
    "Heat oil in a large wide non-stick pan or casserole with a lid. Cook onions on high for 5 minutes, then cook stirring frequently for 20 to 30 minutes until soft and pale.",
    "Remove chicken from marinade with tongs and arrange bone-side down in pan, pushing onions over them. Pour remaining marinade over chicken, turn heat to high, cover with lid and cook for 15 minutes at a fast simmer.",
    "Remove lid, turn chicken pieces over, mix in sauce and simmer uncovered for 30 minutes until chicken is cooked and sauce thickened. Remove chicken if sauce is still runny and reduce sauce on its own.",
    "Return chicken and sauce to the dish it marinated in and cool. Cover and refrigerate overnight or up to two days. Debone and tear chicken into chunks before reheating.",
    "For the rice, put cardamom pods, cinnamon stick, cloves, star anise, desiccated coconut and pink peppercorns in a large pan. Add 2 liters water, sea salt, lime juice and sesame oil. Bring to boil, then turn off heat and keep covered on warm hob.",
    "Rinse rice and soak in cold water for 30 minutes. Near end of soaking, reheat chicken gently and bring scented water to boil.",
    "Drain rice well and add gradually to boiling water. Cover and return to boil, then boil for 2 minutes. Test rice by rubbing a grain between fingers to check if it breaks into 2 or 3 bits. Drain well.",
    "Wipe pan and brush bottom with sesame oil. Add half the rice, sprinkle half the toasted cumin seeds, desiccated coconut and cranberries. Arrange reheated chicken evenly on rice, spooning over any sauce. Cover with remaining rice and sprinkle remaining cumin, coconut and cranberries.",
    "Seal pot top with foil and lid. Place on medium heat for 4 to 5 minutes until steam starts, then reduce heat and cook for 15 to 16 minutes more.",
    "Turn off heat, remove foil carefully to release steam, replace foil with clean tea towel and clamp lid. Leave off heat for 20 minutes or longer.",
    "Cook reserved chicken skin in air fryer at maximum temperature for 12 to 18 minutes until crisp. Keep chicken fat rendered from skins for later use.",
    "Spoon biryani onto platter, arrange chicken and meat attractively. Scrape bottom of pot for crispy bits and crumble chicken crackling over top. Scatter with freshly chopped coriander."
  ]
}
]
